src/cf/InformationRegisters/СведенияОПользователяхДокументооборот.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СведенияОПользователяхДокументооборот</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГрафикРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Ранг</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Catalogs/СтруктураПредприятия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<Name>СтруктураПредприятия</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Руководитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГрафикРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/НаборыДополнительныхРеквизитовИСведений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>НаборыДополнительныхРеквизитовИСведений</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИмяПредопределенногоНабора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Используется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоМеток</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоРеквизитов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоСведений</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПометкаУдаления</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяПредопределенногоНабора</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеСведения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПометкаУдаления</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяПредопределенногоНабора</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Представления</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КодЯзыка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/CommonModules/ОбщегоНазначенияДОАМ/Ext/Module.bsl
// Возвращает Право доступа к Карточке контрагента.
//
// Параметры:
//  СсылкаПользователь - ПараметрыСеанса.ТекущийПользователь - Пользователь для проверки доступа.
// 
// Возвращаемое значение:
//  Логическое - Дать доступ или нет.
//
&НаСервере
Функция ПолучитьПравоДоступаККарточкеКонтрагента(СсылкаПользователь, Объект) Экспорт // 2025-05
	////  заметка по экспорту - https://dzen.ru/a/Y94yCYcNIA0oHidt
	
	РезультатПроверкиКарточкиКонтрагентов = Ложь;
	
	
	Если СсылкаПользователь = Неопределено Тогда
		СсылкаПользователь = Пользователи.ТекущийПользователь();
	КонецЕсли;		
	
	СведенияПользователя = РегистрыСведений.СведенияОПользователяхДокументооборот.Получить(
		Новый Структура("Пользователь", СсылкаПользователь));
	Попытка
		СведенияПользователя.Подразделение.Уровень();
	Исключение
		// ОТЛАДКА
		СсылкаДОАМ = Справочники.СтруктураПредприятия.НайтиПоНаименованию("ДОАМ", Истина);
		СведенияПользователя.Подразделение = СсылкаДОАМ;
	КонецПопытки;
	
	
	Если СведенияПользователя.Подразделение.Уровень() = 0 Тогда
		ПодразделениеРуководителяПользователя = СведенияПользователя.Подразделение;
	Иначе // Каждая "точка" блокирует таблицу
		ПодразделениеРуководителяПользователя = СведенияПользователя.Подразделение.Родитель;
	КонецЕсли;

	////ПодразделениеКарточки = Объект.Ответственный.Подразделение; // Каждая "точка" блокирует таблицу
	ПодразделениеКарточки = РаботаСПользователями.ПолучитьПодразделение(Объект.Ответственный);
	
	////ПодразделенияРуководителя = Справочники.СтруктураПредприятия.ПодчиненныеПодразделения(Объект.Ответственный);
	////Для Каждого ЭлементМассива из ПодразделенияРуководителя Цикл
	////	Если ЭлементМассива.Код = ПодразделениеКарточки.Код Тогда
	////		РезультатПроверкиКарточкиКонтрагентов = Истина;	
	////	КонецЕсли;	
	////КонецЦикла;
	
	Если РольДоступна("АдминистраторСистемы") Тогда // ОТЛАДКА
		Сообщить("[doc8.3] " + ПодразделениеКарточки
			+ ?(ПодразделениеКарточки.Уровень() >= СведенияПользователя.Подразделение.Уровень(), 
				" на одном уровне", " выше уровня") + " с " + СведенияПользователя.Подразделение
			+ ", в котором состоит " + СсылкаПользователь.ПредставлениеВПерепискеСРангом);	
	КонецЕсли;
	
	
	СсылкаОВП = Справочники.СтруктураПредприятия.НайтиПоНаименованию("ОВП", Истина);
	СсылкаОПАМ = Справочники.СтруктураПредприятия.НайтиПоНаименованию("ОПАМ", Истина);
	//// Справочники.СтруктураПредприятия.ВыбратьИерархически(<Родитель>, <Владелец>, <Отбор>, <Порядок>)
	//Выборка = Справочники.СтруктураПредприятия.ВыбратьИерархически(ПодразделениеРуководителяПользователя);
	//Пока Выборка.Следующий() Цикл
	//	ПодразделениеВыбоки = Справочники.СтруктураПредприятия.НайтиПоНаименованию(Выборка);
	//	Сообщить("[doc8.3] " + "" + ПодразделениеВыбоки.Уровень()); 
	
	Если ПодразделениеКарточки.ПринадлежитЭлементу(ПодразделениеРуководителяПользователя) Тогда
		
		Если СведенияПользователя.Подразделение.Уровень() = 0
			И СтрНайти(НРег(СведенияПользователя.Должность), "руководитель департамента") Тогда
			
			РезультатПроверкиКарточкиКонтрагентов = Истина;
			
		КонецЕсли;
		
		Если ПодразделениеКарточки.Родитель.Код = СсылкаОПАМ.Код // 1 = ОПАМ
		И ( ПодразделениеРуководителяПользователя.Код = СсылкаОПАМ.Код
			Или СведенияПользователя.Подразделение.Код = СсылкаОПАМ.Код ) Тогда // Письмо от 2024-12-24
			
			РезультатПроверкиКарточкиКонтрагентов = Истина;
			
		КонецЕсли;
		
		Если ( ПодразделениеРуководителяПользователя.Код = СсылкаОВП.Код // 1 = ОВП
			Или СведенияПользователя.Подразделение.Код = СсылкаОВП.Код )
			И СтрНайти(НРег(СведенияПользователя.Должность), "руководитель подразделения")
		Или ПодразделениеКарточки.Код = СведенияПользователя.Подразделение.Код
			И ( СтрНайти(НРег(СведенияПользователя.Должность), "заместитель руководителя")
			Или СтрНайти(НРег(СведенияПользователя.Должность), "руководитель подразделения") ) Тогда
		
			РезультатПроверкиКарточкиКонтрагентов = Истина;
			
		КонецЕсли;
		
	Иначе
		Если ПодразделениеКарточки.Код = ПодразделениеРуководителяПользователя.Код
			И ПодразделениеРуководителяПользователя.Уровень() <= 1 Тогда // Письмо от 2024-12-24
			
			Если ( ПодразделениеРуководителяПользователя.Код = СсылкаОВП.Код // 1 = ОВП
				Или СведенияПользователя.Подразделение.Код = СсылкаОВП.Код )
				И СтрНайти(НРег(СведенияПользователя.Должность), "руководитель подразделения")
				//И ( ПодразделениеРуководителяПользователя.Код = СсылкаДОАМ.Код // 0 = ДОАМ
				//	Или ПодразделениеРуководителяПользователя.Код = СсылкаОВП.Код ) // 1 = ОВП
			Или ПодразделениеРуководителяПользователя.Код = СсылкаОПАМ.Код Тогда
				
				РезультатПроверкиКарточкиКонтрагентов = Истина;
	//			Прервать;
			
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;
	
	//	Продолжить;
	//КонецЦикла;
	//Выборка = Неопределено;	
	
	
	Возврат РезультатПроверкиКарточкиКонтрагентов;
	
КонецФункции

&НаСервере
Функция РасшДОАМ_ПолучитьРасширенныеРеквизиты() Экспорт
	
	// выбираем свойства у которых пустой набор доп реквизитов
	НаборСвойств = Справочники.НаборыДополнительныхРеквизитовИСведений.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДополнительныеРеквизитыИСведения.Ссылка КАК Свойство,
	|	ДополнительныеРеквизитыИСведения.Наименование,
	|	ДополнительныеРеквизитыИСведения.УникальныйКодДляПоля КАК ИмяПоля,
	|	ДополнительныеРеквизитыИСведения.ТипЗначения,
	|	ДополнительныеРеквизитыИСведения.ЗаполнятьОбязательно
	|ИЗ
	|	ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения КАК ДополнительныеРеквизитыИСведения
	|ГДЕ
	|	ДополнительныеРеквизитыИСведения.НаборСвойств = &НаборСвойств";	
	Запрос.УстановитьПараметр("НаборСвойств", НаборСвойств);	
	РезультатЗапроса 	= Запрос.Выполнить();	
	ТЗРеквизиты 		= РезультатЗапроса.Выгрузить();
	
	Возврат ТЗРеквизиты;
	
КонецФункции
